var cars = {
    '1-1-kia' : [
        '1-1-1',
        '1-1-2'
    ],
    '1-1-dongfengfengshen' : [
        '1-1-3'
    ],
    '1-1-soueast' : [],
    '1-1-mazda' : [
        '1-1-4'
    ],
    '1-1-peugeot' : [],
    '1-1-citroen' : [
        '1-1-5'
    ],
    '2-1-zhengzhourichan' : [
        '2-1-1'
    ],
    '2-1-subaru' : [],
    '2-1-qoros' : [
        '2-1-2'
    ],
    '2-1-renault' : [
        '2-1-3'
    ],
    '2-1-shuanghuan' : [],
    '2-1-ford' : [
        '2-1-4',
        '2-1-5'
    ],
    '2-1-title' : [],
    '3-1-yiqi' : [],
    '3-1-changan2' : [
        '3-1-1'
    ],
    '3-1-changan' : [
        '3-1-2'
    ],
    '3-1-landwind' : [],
    '3-1-suzuki' : [
        '3-1-3'
    ],
    '3-1-shangqi' : [],
    '3-1-tongyongwuling' : [],
    '3-1-datong' : [],
    '3-1-roewe' : [],
    '3-1-mg' : [],
    '4-1-bmw' : [
        '4-1-1',
        '4-1-2',
        '4-1-3'
    ],
    '4-1-acura' : [
        '4-1-4'
    ],
    '4-1-lincoln' : [],
    '4-1-infiniti' : [
        '4-1-5'
    ],
    '4-1-calson' : [],
    '4-1-jaguar' : [
        '4-1-6'
    ],
    '5-1-cadillac' : [
        '5-1-1'
    ],
    '5-1-lexus' : [],
    '5-1-volvo' : [
        '5-1-2'
    ],
    '5-1-ds' : [
        '5-1-3'
    ],
    '5-1-fujianbenz' : [],
    '5-1-benz' : [
        '5-1-4',
        '5-1-5',
        '5-1-6'
    ],
    '6-audi' : [
        '6-1'
    ],
    '6-skoda' : [],
    '6-volkswagen' : [
        '6-2',
        '6-3'
    ],
    '7-lamborghini' : [],
    '7-davidson' : [],
    '7-forum' : [],
    '7-safechair' : [],
    '7-patton' : [],
    '8-porsche' : [
        '8-1'
    ],
    '8-ferrari' : [],
    '8-xingkete' : [],
    '8-rr' : [],
    '8-armadillo' : [],
    '8-speedauto' : [],
    '8-astonmartin' : [],
    '8-maserati' : [],
    '8-bentley' : [
        '8-2'
    ],
    '8-zoemo' : [],
    '8-saleen' : [],
    '8-gmc' : [],
    '1-2-wanlitire' : [],
    '1-2-jac' : [
        '1-2-1'
    ],
    '1-2-hyundai' : [
        '1-2-2',
        '1-2-3',
        '1-2-4',
        '1-2-5'
    ],
    '1-2-shangzhe' : [],
    '1-2-huasai' : [],
    '1-2-tengshi' : [],
    '1-2-beiqi' : [
        '1-2-6',
        '1-2-7',
    ],
    '2-2-gag' : [],
    '2-2-toyota' : [],
    '2-2-mitsubishi' : [
        '2-2-1'
    ],
    '2-2-gacfca' : [],
    '2-2-guangqihonda' : [
        '2-2-2'
    ],
    '2-2-honda' : [],
    '2-2-dongfenghonda' : [
        '2-2-3'
    ],
    '3-2-zhonghua' : [
        '3-2-1'
    ],
    '3-2-luxgen' : [],
    '3-2-buick' : [
        '3-2-2',
        '3-2-3'
    ],
    '3-2-chery' : [
        '3-2-4'
    ],
    '3-2-lifan' : [],
    '3-2-chevrolet' : [
        '3-2-5'
    ],
    '4-2-geely' : [
        '4-2-1',
        '4-2-2'
    ],
    '4-2-haval' : [],
    '4-2-foton' : [],
    '4-2-bridgestone' : [],
    '4-2-qichen' : [],
    '4-2-nissan' : [],
    '5-2-byd' : [
        '5-2-1'
    ],
    '5-2-fengxing' : [],
    '5-2-yiche' : [],
    '5-2-jmc' : [],
    '5-2-toyota' : [
        '5-2-2'
    ]
};

var data = {
    '1-1-1' : {
        'text' : '混动版K5相比汽油版车型在大体上一致，只是细节方面有所改变。前脸方面，混动版K5在雾灯两旁加入装饰边框。车身侧面没有加入新的线条，只是将轮毂换了新的造型，类似于花瓣式的五辐设计比汽油版车型更加简洁，同时更具未来感，十分美观。混动版K5动力来自一台2.4升Theta II汽油发动机和一台30千瓦电动机，配备六速手自一体变速器。官方的城市百公里油耗为6.7升，高速路油耗则为5.9升。',
    },
    '1-1-2' : {
        'text' : '起亚是在2015法兰克福车展上发布了全新一代SPORTAGE，即是国内的智跑，而日前东风悦达起亚官方宣布，全新SPORTAGE将在2015广州车展发布，并采用“KX5”的全新命名。采用的虎啸式进气格栅设计依旧延续了家族的风格，狭长的大灯内部采用全新的造型设计，大灯下方的“田字”日间行车灯比较独特，这种设计此前一直在其概念车上有所展现，未来或将成为起亚新车型的标志性样式。',
    },

    '1-1-3' : {
        'text' : '东风风神全新紧凑型SUV——东风风神AX3，将于广州车展上公布其预售价格，起售价8万元，新车将于今年年底正式上市。风神AX3设计风格偏向硬朗，整车造型时尚，包围套件和行李架的运用更利于营造SUV的气势。新车将配备前雾灯、电动天窗、发动机启停、智能互联系统等配置，同时根据车型配置的差异化提供两种不同风格的轮圈。动力上将搭载的是1.5L和1.4T两款发动机，传动方面将匹配5速手动和6速自动变速箱。 ',
    },

    '1-1-4' : {
        'text' : '在法兰克福车展首发的马自达“KOERU越”概念车将会在广州车展和中国消费者首次见面，量产后有望成为新CX-7或CX-9。KOERU越概念车依然采用马自达的魂动设计理念，车头保持家族式的前脸造型风格，营造出极具运动风格的外观，延续了马自达车系向来注重动感的设计理念。新车中控台整体造型错落有致，木纹饰板与金属质感饰条的应用在质感上较为出色。同时，在中控台中央也设置有悬浮式的多媒体显示屏。',
    },

    '1-1-5' : {
        'text' : 'C4世嘉虽然名字带有C4，但其却没有可以遵循C4L的设计风格，而是延续了现款世嘉的设计理念，并且融入了目前雪铁龙家族最新的前脸元素。而其内饰风格也延续了PSA集团车型中那股简约时尚而又精致耐看的基因。多重的实用配置以及强劲的THP涡轮引擎，也是其亮点。',
    },

    '2-1-1' : {
        'text' : '新款帅客将于广州车展首发并公布价格，新车在外观和内饰方面均有所升级。新帅客前进气格栅具有双横幅镀铬装饰，两侧前灯组样式也进行了调整，内部可以看到透镜结构，高配车型在前保险杠上集成有LED日间行车灯和前雾灯。新车中控采用了全新的造型，上部加入了新的液晶仪表盘，中部是新造型的空调出风口，边缘还有银色装饰，底部则是空调控制区域。新款帅客搭载1.6L和1.5L两款发动机，1.5L发动机还配备了新的ISS智能启停技术。',
    },

    '2-1-2' : {
        'text' : '观致5 SUV在车身体型和离地间隙上都比观致3 SUV更大，低配车型轮胎规格为235/65 R17，而高配则为235/55 R18，同时，新车还采用了掀背式的设计和全景天窗。新车尾部，采用了银色的防擦组件以及双边共两出的排气。动力方面，观致5 SUV将搭载的是一台全新的1.6T涡轮增压发动机，传动系统与发动机匹配的依旧是6速双离合变速箱。',
    },

    '2-1-3' : {
        'text' : '雷诺科雷嘉定位于紧凑型SUV，其运用了雷诺最新的家族式设计理念。海外版Kadjar长宽高分别为4450/1840/1600mm，而关于东风雷诺的国产版本车型是否会针对轴距进行加长，目前我们还尚不确定。海外版雷诺Kadjar提供1.2T、2.0T汽油发动机以及1.6T柴油发动机可选，不过国产车型很有可能仅保留1.2T和2.0T两款汽油发动机。',
    },

    '2-1-4' : {
        'text' : '长安福特的旗舰车型——金牛座将会在广州车展期间正式上市，该车定位于一款中大型车，预售价区间为24.98-34.98万元。金牛座前脸采用了福特家族标志性的倒梯形进气格栅设计。五条镀铬格栅与造型修长、现代的前大灯融为一体，并配以标志性的LED日间行驶灯以及LED投射灯。内饰方面，长安福特金牛座内部延续了较为稳重的设计风格，而动力方面，金牛座将搭载2.0T和2.7T两种发动机供消费者选择。',
    },

    '2-1-5' : {
        'text' : '长安福特蒙迪欧将新增一款1.5T时尚智能型，新车有望于11月公布售价。即将推出的蒙迪欧1.5T时尚智能型将在1.5T时尚型基础上，增加SYNC多媒体交互系统，其他配置变化暂未公布。动力方面，新车依旧搭载一台1.5L Ecoboost涡轮增压发动机，最大功率133kW，最大扭矩240Nm。与之匹配的是6速手自一体变速器。 ',
    },

    '3-1-1' : {
        'text' : 'CS15的外观相比CS35要硬朗很多，特别是整体的造型更加动感，配合亮丽的色彩，十分适合第一次购车的年轻人。内饰造型与现有的长安车型保持类似，不过这款年轻的SUV还采用了大面积的撞色设计，突出了动感与活力，也将会是CS15的重要卖点之一。动力方面，CS15会搭载一款1.5升排量自然吸气发动机。',
    },

    '3-1-2' : {
        'text' : '欧尚是长安商用车推出的一款MPV车型，新车采用2+3+2的七座位布局，长宽高分别为4465/1725/1685mm，轴距为2680mm。外观方面，长安欧尚的前格栅采用大块横条幅镀铬装饰条，试图为这款家用MPV车型营造出一种豪华的感觉。长安商用全新7座MPV车型长安欧尚将于11月20日广州车展正式上市。',
    },

    '3-1-3' : {
        'text' : '长安铃木维特拉已经启动预售，新车将于广州车展上市，国产维特拉延续了海外版的设计风格，整体造型动感。车身采用双色车身设计，车顶呈现出悬浮车顶的视觉效果。内饰采用“T形”中控布局，配备有8.7英寸中控触摸屏，中控台上没有再设置多媒体系统控制按键。动力方面，国产维特拉搭载1.6L和1.4T两款发动机，与之匹配的将是6速手动和6速自动变速箱。此外，两款发动机还将标配发动机启动系统。',
    },

    '4-1-1' : {
        'text' : '宝马新款6系家族前脸造型相比现款车型有所调整，其前后保险杠进行了加宽处理，并更换全新LED前大灯。新车上市后除了基本版车型之外，还将提供越野风格套件、卓越风格套件以及M运动风格套件供消费者选择。动力系统方面，宝马新款6系提供640i和650i两种动力配备车型可选。其中640i搭载3.0T发动机，最大输出功率320马力，峰值扭矩450牛·米。650i车型配备的是4.0T发动机，最大输出功率408马力，峰值扭矩为600牛·米。',
    },

    '4-1-2' : {
        'text' : '新款车型延续了老款的外观设计，巨型进气口、黑色网状进气格栅、个性的前唇都会让人意识到该车并非是一款普通的宝马3系。相比于老款车型，新款M3的改变主要在细节方面，例如采用新的全LED尾灯，车内将会增加一些镀铬装饰。动力系统部分，新款M3将继续搭载3.0T双涡轮增压直列6缸发动机，这台发动机的最大功率为431马力/5500-7300rpm，峰值扭矩为550牛·米/1850-5550rpm。在传动系统部分，与发动机匹配的是7速双离合变速箱。',
    },

    '4-1-3' : {
        'text' : '宝马X5插电式混合动力版车型将于11月20日开幕的广州车展上市，该车由2.0T发动机和电动机组成，该车从静止加速至100km/h需要6.8秒。宝马X5插电式混合动力版的高压锂离子电池组安置在后备厢地板下方的防撞安全位置，不会占用额外的储物空间。另外，新车还具有AUTO eDrive、MAX eDrive、SAVE Battery三种驱动模式选择，例如选择MAX eDrive模式，新车切换到纯电动零排放驱动，仅依靠电动机驱动，最高时速可达120km/h。',
    },

    '4-1-4' : {
        'text' : '2016款讴歌RDX将于下月举行的广州车展上市，相比老款车型，2016款讴歌RDX在外观上采用了全新的家族设计。前脸部分采用了经过镀铬处理的盾形前进气格栅，前大灯加入了LED光源，给人一种科技感十足的感觉。2016款讴歌RDX采用了上深下浅的双色设计，中控台的双液晶显示屏设计依旧是最大的看点。2016款讴歌RDX搭载了一台拥有钝缸技术的3.5L V6发动机，与之搭配将是一台全新的9速自动变速箱。此外，新车还将配备四驱系统。 ',
    },

    '4-1-5' : {
        'text' : '英菲尼迪QX30概念车曾于2015日内瓦车展全球首发，量产版车型将于11月的广州车展全球首发，新车竞品车型将锁定在奔驰GLA级的身上。英菲尼迪QX30将采用十分时尚的外观设计，新车前脸设计个性，两侧的大灯造型极其犀利，全LED头灯加上环绕四周的LED光带很容易吸引眼球。动力系统方面，英菲尼迪QX30量产版将提供1.6T、2.0T涡轮增压发动机可选，传动系统与发动机匹配的是7速双离合变速箱。 ',
    },

    '4-1-6' : {
        'text' : '捷豹F-PACE是该品牌推出的首款SUV车型，新车在外观方面延续了捷豹家族动感的外观设计，大尺寸进气格栅配合犀利的LED前大灯组，使新车看起来霸气十足。捷豹F-PACE在汽油发动机方面提供2.0T直列四缸发动机和3.0L V6机械增压发动机。传动方面，与发动机匹配的是自采埃孚的8AT自动变速箱。',
    },

    '4-1-7' : {
        'text' : '奇瑞捷豹路虎揽胜极光在外形上与进口版本保持一致，只是车尾“奇瑞路虎”的LOGO“泄露”了该车的国产身份。奇瑞捷豹路虎揽胜极光依旧搭载2.0T涡轮增压发动机，其最大功率为177Kw/5500rpm，最大扭矩为340N.m/1750rpm。而在变速箱方面，国产揽胜极光将会配备和进口版车型一样的9速手自一体变速箱。',
    },

    '5-1-1' : {
        'text' : '作为凯迪拉克旗舰型车型，CT6于今年底或明年初正式引入国产。凯迪拉克CT6采用最新的家族化设计风格，前进气隔栅更扁平，更具层次感。作为一大亮点，大灯采用凯迪拉克钻石切割设计元素且加入了垂直的日间行车灯设计。新车搭载最新3.0T双涡轮增压发动机，与之匹配的是8AT变速箱，并配有主动后轮转向系统、电磁感应式悬架等科技配置，非常具有吸引力。',
    },

    '5-1-2' : {
        'text' : '全新XC90 T8插电混动版车型与目前在售的全新XC90造型基本保持一致。新车将标配“Orrefors”水晶换挡杆、Nappa真皮座椅等配置。全新XC90 T8插电混动版搭载的是由2.0T双增压发动机与电动机组成的混合动力系统，其中发动机的最大输出功率为320马力；电动机的最大输出功率为87马力。官方称新车的0-100km/h加速时间为5.6秒，综合油耗仅为2.6L/100km。',
    },

    '5-1-3' : {
        'text' : '在DS品牌脱离雪铁龙后，旗下车型开始采用DS品牌独立logo，以此来区分与雪铁龙品牌的不同。新车在外观上的变化是使用了DS最新的家族式前脸，放弃了雪铁龙品牌logo，新车将使用LED大灯组，尾灯造型也十分新颖，相比其他车型要显得更为科幻一些。与此同时DS4还将新增一款跨界车型，新车将搭载1.2T发动机，同时还配备1.6THP发动机。',
    },

    '5-1-4' : {
        'text' : '奔驰C350eL混动版车型将于广州车展正式上市。外型上，奔驰C350eL与现款全新C级长轴距版并无二致，只是在尾部左上角加入了C350eL标志以凸显其混动车身份。同时，奔驰C350eL配置也相当丰富，搭载有全新多连杆悬架系统、LED智能照明、注意力辅助系统。动力上，新车将搭载一套插电式混合动力系统，由2.0T四缸涡轮增压发动机和电动机组成。整个动力系统综合最大功率达到279Ps，峰值扭矩为600Nm。',
    },

    '5-1-5' : {
        'text' : '奔驰新款A级换装了全新的LED前大灯，标志性的日间行车灯灯带依旧看起来很时尚，此外新车前保险杠造型相比现款车型也更加运动。动力系统方面，奔驰新款A级仍将搭载1.6T或2.0T汽油发动机，不过新增的入门级A 160车型，其配备的是一台低功率版1.6T发动机，最大输出功率为102马力，峰值扭矩为180牛·米。未来入门级A 160车型的引入，将拉低该车在国内的售价区间。',
    },

    '5-1-6' : {
        'text' : '北京奔驰GLC级将于广州车展前夕正式上市，其上市日期为11月19日，新车作为GLK级的换代车型，其外观、内饰、动力等方面全线提升。奔驰GLC级采用了更加简约的中控面板，并配备了全新COMAND系统的控制机构、液晶显示的仪表以及悬浮式液晶屏等，奔驰GLC级提供不同调校的2.0T涡轮增压发动机供消费者选择，其最大输出功率分别为184马力GLC 200、211马力GLC 260和245马力GLC 300。传动系统与发动机匹配的是9速自动变速箱。',
    },

    '6-1' : {
        'text' : '奥迪新一代Q7采用了奥迪最新的外观设计理念，使得新车看起来很有力量感，而颇有亮点的LED矩阵式前大灯只在顶配的45 TFSI 尊贵版车型上配备，而其他车型会根据配置的不同提供氙气和LED可选。新一代Q7 40 TFSI搭载的是2.0TFSI发动机，其最大功率为252马力，峰值扭矩369牛·米，而45 TFSI则搭载的是3.0TFSI发动机，最大功率为333马力，峰值扭矩440牛·米。传动方面，与发动机匹配的将是8速手自一体变速箱。',
    },

    '6-2' : {
        'text' : '',
    },

    '6-3' : {
        'text' : '一汽-大众换代迈腾车型国产版PASSAT B8将于此次广州车展上正式发布。新车将基于大众最新MQB模块化平台打造而成，国产后将采用全新的中文名称，随后将于明年年中上市销售。新车采用最新家族式的设计理念，其配备了全新镀铬进气格栅，且与前大灯连为一体，整个前脸设计给人十足的好感。换代迈腾将基于MQB平台打造而来，整备质量相比现款将进一步降低。新车将继续提供1.4TSI、1.8TSI以及2.0TSI发动机可选，其中后两者均属于第三代EA888发动机。与之匹配的是DSG双离合器变速箱。',
    },

    '8-1' : {
        'text' : '保时捷新款911车型将会在11月的广州车展进行中国首发。新款911前脸相比现款变化并不是非常明显，前大灯组内部灯腔造型有所变化，前保险杠两侧进气口造型也发生了小幅调整，视觉效果更加时尚。新车搭载一台全新的3.0L双涡轮增压水平对置六缸发动机，并提供两种不同调校，新款保时捷911 Carrera的最大功率为370马力，峰值扭矩420牛·米，相比搭载3.4L发动机的现款车型上涨了20马力和30牛·米；新款保时捷911 Carrera S的最大功率为420马力，峰值扭矩500牛·米。',
    },

    '8-2' : {
        'text' : '宾利旗下首款SUV车型添越将会在广州车展亮相，这款奢华SUV已上市，售价398万起。添越借鉴了EXP 9 F概念车的设计理念，前脸采用了品牌标志性的全LED圆灯造型，中网格栅等多处均采用了镀铬网状设计。新车提供四座和五座两种内部布局，内饰上充分体现了对细节上的精雕细琢，真皮与实木的结合瞬间体现奢华之感。动力系统方面，新车搭载的是一台6.0L W12双涡轮增压发动机，官方称，该车0-100km/h加速时间为4.1秒，最高时速可达到301km/h。',
    },

    '1-2-1' : {
        'text' : '定位于中大型MPV的江淮瑞风M6将于广州车展正式上市，预计售价12万元左右，新车采用了全新的宝瓶口家族化前脸设计，大灯内部还加入了LED日间行车灯，造型简约而不失精致。双色配色内饰，中控台屏幕尺寸很大，配备了分区自动空调、支持多媒体、电话和导航功能的娱乐中心。第二排是两个互不干扰的独立座椅，电动脚踏板一应俱全，甚至还有内置空气净化装置。预计将延续M5的动力配置，搭载2.0T汽油版和1.9CTI柴油版两款发动机。',
    },


    '1-2-2' : {
        'text' : '全新朗动将于下月举行的广州车展上发布，并与明年第二季度正式上市。全新朗动相比现款车型做了很大改动，新车采用最新的家族式前脸，前大灯造型更为犀利，并且集成了弧形的LED日间行车灯。内饰方面，全新朗动采用非对称式布局，纯黑色内饰也更符合运动化设计风格。新车配备了8英寸中控显示屏、可自动调整IMS记忆座椅、HBA远光灯辅助、BSD盲点监测和RCTA倒车预警等科技配置。动力上新款朗动仍搭载1.6L和1.8L两款发动机。',
    },

    '1-2-3' : {
        'text' : '北京现代名图1.6T车型将在广州车展正式上市,预计售价12.98万元。相比现款车型，1.6T车型的前中网采用了全新的设计，整体外观更加运动。同时1.6T车型还配有全新设计的轮毂,尾部“TGDI”标识十分醒目，新车还采用了单边两出排气。新车内饰延续了现款车型布局，但深色的仿木纹饰板看上去更有质感。动力方面，新车将搭载一台1.6T涡轮增压发动机，传动系统有望匹配一台7速双离合变速箱。'
    },

    '1-2-4' : {
        'text' : '北京现代官方正式公布了其2015广州车展新车阵容，其中包含了第九代索纳塔混动版车型。新车沿袭了第九代索纳塔，新车充电口位于左前翼子板边缘，并配有blue derive标识，同时在尾部还标有hybrid标识凸显出于普通版的不同。 索纳塔插电式混合动力版搭载一台2.0L发动机和可输出68Ps的电动机组成,传动部分匹配6速自动变速箱。电池组方面，配备的电池组容量达到9.8千瓦/时，纯电模式下续航里程约为35公里。',
    },

    '1-2-5' : {
        'text' : '北京现代ix25 1.6T车型已于10月16日下线，预计新车可能在年尾这个广州车展正式上市。新增的1.6T车型在外观方面，将与其它版本的车型基本保持不变。唯一的变化，就是新车采用了双横辐镀铬进气格栅，并且在车尾部分增加了“TGDi”标识。新车的内饰与现款车型并没有太大变化。新车内饰采用了纯黑色调，配有多功能方向盘和一键启动。也许是低配车型的缘故，中控区域并没有采用大屏显示、自动空调等配置。',
    },
    '1-2-6' : {
        'text' : '北汽绅宝X55采用了其最新家族式设计理念打造，新车头部标志性的蝴蝶翼造型前进气格栅有着很高的辨识度。新车的长/宽/高分别为4405mm/1809mm/1685mm，轴距为2650mm。北汽绅宝X55或将搭载1.5L自然吸气以及1.5T涡轮增压两款发动机，与发动机匹配的是5速手动或6速手自一体变速箱。另外，新车将采用前麦弗逊/后多连杆式双独立悬架。'
    },
    '1-2-7' : {
        'text' : '北汽EU200基本延续了普通版绅宝D50车型的外观设计，在前脸车标下方设置了快速充电接口。新车的内饰设计和普通版车型相比变化不大，挡位区采用了旋钮式换挡杆。新车将搭载38kWh的三元锂电池组，电机输出功率为136马力，最大续航里程将达到200km，预计还将推出针对出租用车市场的快速换电版车型。'
    },
    '2-2-1' : {
        'text' : '新款欧蓝德PHEV刚刚于10月初在法兰克福车展上首发，预计将在11月的广州车展上亮相国内。新车最引人注目同时也是最重要的修改是新的盾牌型的进气格栅，全新样式的18寸轮圈也是PHEV的专享配置。新车充分利用LED技术,不仅使新欧蓝德的外观更现代，还能大大减少对汽车电气系统的依赖。欧蓝德PHEV改善前悬挂横梁以提升行驶稳定性，混合动力系统经历了一些小的修改，二氧化碳排放量从44g/km到42克/公里。',
    },

    '2-2-2' : {
        'text' : '广汽本田新款凌派将于11月20日开幕的广州车展亮相，新款凌派前脸镀铬装饰明显减少，同时进气格栅的面积增大，具有本田最新家族式前脸的风格。另外，两侧雾灯细节也有所调整。新款车型将5AT变速箱升级为CVT变速箱，行驶平顺性以及燃油经济性大大提高。同时，1.8L自然吸气发动机的最大输出功率被调至100kW，相比起老款车型的102kW最大功率略有降低。 ',
    },

    '2-2-3' : {
        'text' : '东风本田新款艾力绅将于广州车展首发，新车将于2016年1月正式上市。新艾力绅在外观方面变化较大，前进气格栅采用四横条幅式设计，并采用大面积镀铬装饰，尾部最明显的变化在于尾灯组，新车采用了面积较大的LED光源，尾灯组之间还配备有镀铬装饰。新款艾力绅将配备代号为K24V6的2.4L地球梦发动机，其最大输出功率137千瓦，峰值扭矩243牛·米。传动系统方面，与发动机匹配的是一台CVT变速箱，它将取代目前使用的5速自动变速箱。',
    },

    '3-2-1' : {
        'text' : '华晨F20定位紧凑型轿车，并有望在广州车展首发，未来新车上市后将会成为现款中华H330的换代产品。华晨中华F20的前脸采用了中华家族最新式的“T”字形前进气格栅，其格栅内部使用了熏黑处理。车身侧面采用了前低后高的设计，使整体看起来更有冲击力。车尾造型简约，相比H330更加时尚。动力方面，华晨中华F20将搭载一台1.5T涡轮增压发动机，与之匹配的是5速手动或5速手自一体变速箱。 ',
    },

    '3-2-2' : {
        'text' : '早在11月初，别克官方就发布了少量全新君越预告图。从预告图来看，新车相比现款车型更加流畅，采用了大量的别克Avenir概念车设计元素。新车前脸采用了别克家族直瀑式的前进气格栅，新增加的一条飞翼式的镀铬横条，与别克最新家族化风格相符。内饰上，全新君越同样借鉴Avenir概念车设计风格，采用别克360°环抱式设计。动力方面，新一代车型将会继续搭载2.0T和3.6升V6发动机，有望搭载通用与福特联合研发的全新9速自动变速箱。 ',
    },

    '3-2-3' : {
        'text' : '威朗轿跑/威朗GS将于11月18日广州车展前夕正式上市并公布售价，两款车分别为威朗两厢版以及威朗性能版车型，威朗轿跑/威朗GS的前脸设计与威朗三厢版比较相似，不过威朗GS定位更加运动化，特有的专属动感套件，整体设计风格让人眼前一亮。全黑运动内饰中出挑的炫红、碳纤维纹理饰条等，很好地突出了运动感。动力方面，威朗GS将搭载1.5T涡轮增压发动机，并全系标配发动机自动启停功能。',
    },

    '3-2-4' : {
        'text' : '奇瑞艾瑞泽5将于广州车展首发，艾瑞泽5与艾瑞泽7同属紧凑级阵营，相对来说定位要稍低一些。新车将与此前曝光的艾瑞泽3造型有些相似，这也是因为采用了全新家族式设计。前格栅采用了蜂窝状的设计，LOGO至于格栅中央，前雾灯周围配以镀铬装饰。动力方面，艾瑞泽5将会搭载型号为SQRE4G16的1.6L发动机，同时新车还将搭载奇瑞最新的型号为SQRE3T12的1.2T发动机。',
    },

    '3-2-5' : {
        'text' : '国产全新一代迈锐宝将在11月20日开幕的广州车展上首发亮相，新车将命名迈锐宝XL，并于明年上半年正式上市。新车的外观将采用全新家族设计，更加扁平化设计的前脸更显犀利，C柱之后的溜背造型让新车更具运动感。相比于现款车型，新一代迈锐宝整车长度增加58mm，轴距增加91mm，而整备质量相比于现款车型却降低了136千克。动力方面，全新一代迈锐宝将搭载2.0T和1.5T两款完全不同于现款迈锐宝的发动机。',
    },

    '4-2-1' : {
        'text' : '作为吉利首款高端紧凑型SUV，吉利NL-3正式定名为“博越”，或将于广州车展，2016年初上市销售。吉利博越的家族式水滴涟漪格栅和鹰眼LED大灯融为一体，车身侧面也突显出较强的力量感，而隐藏D柱、悬浮式车顶的设计让该车看上去更为时尚。内饰采用大量平滑线条，形成流畅飘逸的视觉效果，官方宣称在内饰线条设计上借鉴了西湖断桥的造型元素。新车有望提供1.8L、1.8T和2.4L三款发动机，传动系统匹配手动或自动变速箱，并将配备四驱系统。 ',
    },

    '4-2-2' : {
        'text' : '吉利帝豪S7是吉利帝豪旗下的一款两厢紧凑型轿车，预计售价将在6万-8万元之间。作为国内最畅销的自主品牌车型，自从去年发布CORSS的概念车后，这款车就一直备受关注，如今终于要和消费者们见面了。帝豪S7采用了类似博瑞的帝豪家族最新的“回纹涟漪”式中网设计，造型视觉效果不错，颇为时尚。新车将会搭载1.3T涡轮增压发动机和1.8L自然吸气发动机，传动方面，将匹配5速手动、6速自动变速箱。',
    },

    '5-2-1' : {
        'text' : '作为“542”战略车型中主要面向年轻人的产品，比亚迪元定位于一款小型SUV，其采用了比亚迪最新的家族式设计，前脸造型十分个性。在尺寸方面，其长宽高分别为4320/1765/1650mm，轴距为2520mm，车型小于唐和宋。动力方面，由一台1.5L自然吸气发动机和两台电动机搭配，纯电最大续航里程可达70公里，百公里加速4.9秒。该车如唐和宋一样将采用比亚迪全时四驱系统。',
    },

    '5-2-2' : {
        'text' : '继全新兰德酷路泽网络曝光图揭晓之后，有望在广州车展正式上市，其预计售价为77万元。新兰德酷路泽的前脸变化比较明显，明显感觉到进气格栅的镀铬装饰更加粗壮了。进气格栅中间的辐条也贯穿进了大灯组，使得新车的整体性、层次感更加清晰。另一重大改变在于前大灯组采用了LED照明系统，在实用性和科技感方面都有明显的提升。内饰最大的变化在于细节上的调整以及配色。方向盘的设计也更为精致，按键之间的颜色搭配非常时尚。',
    }
};

var index = 0,
    list = $( '.car-list-area .list-page' ),
    listPageLength = list.length,
    el = $( '.car-list-area .inner' );

var changePage = function( i ) {
    el.css( 'marginLeft', 0 - i * 100 + '%' );
    index = i;
    scrollScrollbar();
};

var swipe = function( duration ) {
    if( duration === 'right' ) { 
        if( !index ) return false;
        changePage( index - 1 );
    } else {
        if( list.length - 1 == index ) return false;
        changePage( index + 1 );
    }   
};

var scrollScrollbar = function() {
    var i = 159 / ( listPageLength - 1 );
    $( '.scroll-bar .tiplight' ).css( 'left', index * i );
};

el.css( 'width', ( listPageLength * 100 ) + '%' );

$( '.car-list-area' ).css( 'width', $( document ).width() ).find( '.list-page' ).css( 'width', $( document ).width() );

$( '.car-list-area' ).on( 'swipeLeft', function( e ) {
    swipe( 'left' );
} ).on( 'swipeRight', function( e ) {
    swipe( 'right' );
} ).on( 'touchmove', function( e ) {
    e.preventDefault();
} );

var renderlist = function( e ) {
    var hash = location.hash.replace( /^#/, '' ),
        container = $( '.list-page ul' ),
        html = '<li><a href="###"><img /></a></li>',
        path,
        item,
        i = 0,
        l;

    if( !cars[ hash ] ) return false;

    for( l = cars[ hash ].length; i < l; i += 1 ) {
        item = $( html );
        path = '@@path.images/exp-cars/' + cars[hash][i].replace(  /-(\d+)$/, '/$1.png' );
        item.find( 'img' ).attr( 'src', path );
        item.find( 'a' ).attr( 'data-id', cars[ hash ][i] );
        container.append( item )
    }

    $( '.scroll-bar' ).hide();

};

renderlist();

$( window ).on( 'hashchange', renderlist );

var renderintro = function( id ) {
    var txt = data[ id ],
        dir = '@@path.images/exp-cars/' + id.replace( /-(\d+)$/, '/$1/' ),
        i = id.substr( id.lastIndexOf( '-' ) + 1 ),
        el = $( '.intro-box' );

    el.find( '.title img' ).attr( 'src', dir + i + 'name.jpg'  );
    el.find( '.image-area img' ).attr( 'src', dir + i + 'pic.jpg' );

    el.find( '.txt' ).html( txt.text );
    el.show();

};

$( '.list-page' ).on( 'click', 'a', function( e ) {
    e.preventDefault();
    renderintro( $( this ).attr( 'data-id' ) );
} );

$( '.intro-box' ).on( 'click', function( e ) {
    e.preventDefault();
    $( this ).hide();
} );
